Revit 2027 API
ParameterTypeId.ClientName Property
 "Client Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ClientName { get; }
Public Shared ReadOnly Property ClientName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ClientName {
	ForgeTypeId^ get ();
}
static member ClientName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace